app/views/documents/_form.html.erb

    <%= f.label 'User' %><br />
    <%= f.select :user_id, current_company.users.all.collect {|us| [ us.name, us.id ] } %>
---
SELECT `users`.* FROM `users` WHERE (`users`.company_id = 6)

    <%= f.label 'Document Type' %><br />
    <%= f.select :doctype_id, current_company.doctypes.all.collect {|dt| [ dt.name, dt.id ] } %>
---
SELECT `doctypes`.* FROM `doctypes` WHERE (`doctypes`.company_id = 6)