app/controllers/companies_controller.rb

  def index
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def show
    if params[:company_usersname]
     @company = Company.find_by_username(params[:company_usersname])
    else
      @company = Company.find(params[:id])
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`username` = 'newComp' LIMIT 1
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def edit
    @company = Company.find(current_company.id)
---
SELECT `companies`.* FROM `companies` WHERE `companies`.`id` = 6 LIMIT 1

  def create
    @company = Company.new(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO `companies` (`phone`, `url`, `username`, `admin`, `company_name`, `city`, `logo_updated_at`, `address`, `logo_file_name`, `updated_at`, `zip`, `state`, `created_at`, `password_hash`, `logo_content_type`, `email`, `logo_file_size`, `password_salt`) VALUES ('', 'http://www.benerino.com', 'benerinoStudios', NULL, 'Benerino Studios', '', '2012-04-05 21:51:47', '', 'lil_dude.png', '2012-04-05 21:51:49', '', '', '2012-04-05 21:51:49', '$2a$10$GU.fR.e/8E3nh4ykCsqnnOmztaxweyBO70R1T3BEgapy8uozhXYz.', 'image/png', 'benhall2121@yahoo.com', 36172, '$2a$10$GU.fR.e/8E3nh4ykCsqnnO')