app/controllers/doctypes_controller.rb

  def index
    @doctypes = current_company.doctypes.find(:all, :order => 'name')
---
SELECT `doctypes`.* FROM `doctypes` WHERE (`doctypes`.company_id = 6) ORDER BY name

  def show
    @doctype = Doctype.find(params[:id])
---
SELECT `doctypes`.* FROM `doctypes` WHERE `doctypes`.`id` = 1 LIMIT 1

  def edit
    @doctype = Doctype.find(params[:id])
---
SELECT `doctypes`.* FROM `doctypes` WHERE `doctypes`.`id` = 1 LIMIT 1

  def create
    @doctype = current_company.doctypes.new(params[:doctype])

    respond_to do |format|
      if @doctype.save
---
INSERT INTO `doctypes` (`name`, `company_id`, `updated_at`, `created_at`) VALUES ('DocType 2', NULL, '2012-03-29 22:04:25', '2012-03-29 22:04:25')

  def update
    @doctype = Doctype.find(params[:id])

    respond_to do |format|
      if @doctype.update_attributes(params[:doctype])
---
SELECT `doctypes`.* FROM `doctypes` WHERE `doctypes`.`id` = 1 LIMIT 1
UPDATE `doctypes` SET `name` = 'how cool', `updated_at` = '2012-03-30 21:25:20' WHERE `doctypes`.`id` = 7

  def destroy
    @doctype = Doctype.find(params[:id])
    @doctype.destroy
---
SELECT `doctypes`.* FROM `doctypes` WHERE `doctypes`.`id` = 3 LIMIT 1
DELETE FROM `doctypes` WHERE `doctypes`.`id` = 3