app/controllers/documents_controller.rb

  def email_doc
    @user = User.authenticate(params[:username], params[:password]);

    if @user #params[:user_id].to_i == @user.id
      @doc = @user.documents.find(:first, :conditions => ['id = ?',params[:doc_id]], :order => 'updated_at desc')
---
SELECT `documents`.* FROM `documents` WHERE (`documents`.user_id = 16) AND (id = '4') ORDER BY updated_at desc LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'benhall2121' LIMIT 1

  def doc_phone
    @user = User.authenticate(params[:username], params[:password]);

    if @user
      @docs = @user.documents.find(:all, :order => 'updated_at desc')
---
SELECT `users`.* FROM `users` WHERE `users`.`username` = 'benhall2121' LIMIT 1
SELECT description, doctype.name, doc.url FROM `documents` WHERE (`documents`.user_id = 16) ORDER BY updated_at desc

  def index
    @documents = current_company.documents.all
---
SELECT `documents`.* FROM `documents` WHERE (`documents`.company_id = 6)

  def index_current_user_docs
    @documents = current_user.documents.all
---
SELECT `documents`.* FROM `documents` WHERE (`documents`.user_id = 16)

  def show
    @document = Document.find(params[:id])
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 1 LIMIT 1

  def create
    @document = current_company.documents.new(params[:document])

    respond_to do |format|
      if @document.save
---
INSERT INTO `documents` (`description`, `user_id`, `doc_updated_at`, `doc_content_type`, `doctype_id`, `doc_file_name`, `doc_file_size`, `updated_at`, `company_id`, `created_at`) VALUES ('Another Southwest', 17, '2012-05-10 23:28:01', 'application/pdf', 2, 'Southwest_Airlines_-_Print_Boarding_Passes_and_Security_Documents.pdf', 166112, '2012-05-10 23:28:09', 7, '2012-05-10 23:28:09')