app/controllers/password_resets_controller.rb

  def create
    user = User.find_by_email(params[:email])
---
SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'benhall2121@yahoo.com') AND (`users`.id <> 16) LIMIT 1

  def edit
    @user = User.find_by_password_reset_token!(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'lnJGBlj6e6aZfBi73A0U0w==' LIMIT 1

  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => "Password reset has expired."
    elsif @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'lnJGBlj6e6aZfBi73A0U0w==' LIMIT 1
UPDATE `users` SET `updated_at` = '2012-05-30 18:31:44', `password_hash` = '$2a$10$2R.zljI6VEGcDXxkBvQHx.bn.bJjAMcDAxfuXcEJb0tKfJB/VBKPG', `password_salt` = '$2a$10$2R.zljI6VEGcDXxkBvQHx.' WHERE `users`.`id` = 16