app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.company_id = 6) ORDER BY name
---
  def index
    @users = current_company.users.find(:all, :order => 'name')

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @user = User.find(current_user.id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 16 AND (`users`.company_id = 7) LIMIT 1
---
  def edit
    @user = current_company.users.find(params[:id])

INSERT INTO `users` (`password_salt`, `password_hash`, `updated_at`, `company_id`, `username`, `created_at`, `email`, `name`) VALUES ('$2a$10$3Q7zuYnbUXQlztUZP02Pvu', '$2a$10$3Q7zuYnbUXQlztUZP02PvuapKzYdKmslfgRdAjXlblVXqvDrplotC', '2012-04-05 21:32:31', 6, 'bnhgssswnvnvnvbbbnhgsss', '2012-04-05 21:32:31', 'benhall2121@yahoo.com', 'bw be')
---
  def create
    @user = current_company.users.new(params[:user])

    respond_to do |format|
      if @user.save